local T={
--[[超人系]]
"1 橡皮果实——Monkey·D·Luffy。靠无与伦比的拉伸性和弹性来进攻和防御，身体利用橡胶性质进行攻击。",
"2 分裂果实——Buggy。身体能随意分裂合并，脚不可离开地面，分裂部分不得离中心200以外，否则会失去控制。",
"3 光滑果实——Alvida。肌肤变得光滑，可以消去一切摩擦。",
"4 爆炸果实——Mr.5。身体任何部分都有爆破能力，可吞下炸弹。",
"5 重量果实——Ms. Valentine。可改变体重，1kg～1万kg。",
"6 融化果实——Mr.3。可制造蜡，凝固时像钢铁般坚硬，不耐火。",
"7 吞食果实——Wapol。可吞下任何东西，可将吞下物与自己合体，也可合成，可吞下自己令自己变瘦。",
"8 花之果实——Nico·Robin。身体任何一个部位可以像花一样在看得见的地方绽放，对自然系、软骨鱼人无效。",
"9 模仿果实——Bon·Kurei。可变成右手触摸过的人，左手摸脸可复原，变身时不可使人妖拳法",
"10 刀刃果实——Daz·Bonez。身体任何一部分都可以变成刀刃，皮肤可像钢铁般坚硬",
"11海胆果实——Paula。身体可像海胆一样长出尖锐的刺。",
"12铁栏果实——Hina。手臂穿过的物体会被铁栏扣住。（又叫监狱果实）",
"13　　弹簧果实——Bellamy。腿部可变成弹簧，借助外物可以产生快速和大力。",
"14　　肉垫果实——Bartholomew·Kuma。手掌有肉垫，可将任何东西弹开。",
"15　　缓慢果实——Foxy。可放出缓慢光线，与光线接触的物体会缓慢30秒",
"16　　门之果实——Blueno。可在任何地方开门。",
"17　　泡沫果实——Kalifa。可制造泡沫，进行防御，与泡沫接触者会暂时失去力气，水可冲走、风可吹走泡沫。",
"18　　溜球果实——Very-Good。身体可分裂成球体。",
"19　　生锈果实——Shuu。可将接触的东西锈蚀。",
"20　　车轮果实——Sharinguru。身体各部分可像车轮般旋转。",
"21　　黄泉果实——Brook。可复活一次，死后灵魂要找到自己的遗体。",
"22　　透明果实——Absalom。身体可透明化，可将接触过的东西透明化。",
"23　　幽灵果实——Perona。可产生灵体，被消极幽灵穿过身体的人会变得消极，可将迷你/特制幽灵可造成强大的冲击。",
"24　　影子果实——Gekoc·Moria。可剪去他人影子并放入尸体变成僵尸，影子遇盐会离开尸体，可将自己本体与影子掉换。",
"25　　甜甜果实——Boa·Hancock。可用双手发出甜甜甘风，有色心者会被石化，可将被石化者复原，可用手从嘴唇发射枪吻。",
"26　　毒之果实——Magellan。可制造出毒气、毒液。",
"27　　荷尔蒙果实——Emberio·Ivankov 。可将人从内部改造。",
"28　　剪刀果实——伊娜兹玛。可将手变成剪刀，将剪开的东西像纸一样操纵。",
"29　　震震果实——Edward·Newgate。可发出强烈震动，引发地震、海啸等灾难，也可将物体震碎。",
"30　　钻石果实——Joz。全身可变成钻石，硬度足以抵挡鹰眼的斩击。",
--[[动物系]]
"31　　幻兽系凤凰——白胡子海贼团一队队长。变成不死鸟凤凰，544话",
"32　　牛之果实-野牛型——Dalton。可变成野牛。\n      长颈鹿型——Kaku。可变成长颈鹿。",
"33　　人型果实——Tony·Tony·Chopper。可变成人类。",
"34　　鸟之果实——Bell。可变成隼。",
"35　　犬之果实-胡狼型——Chaka。可变成胡狼。\n　　猎犬型——Lasso。可变成腊肠狗。\n      野狼型——Jabra。可变成野狼。 ",
"36　　鼹鼠果实——Ms.Merry Christmas。可变成鼹鼠，潜入地底。",
"37　　马之果实——Pierre。可变成马。",
"38　　猫科果实——Rob·Lucchi。可变成豹。",
"39　　大象果实——Funkfried。可变成大象。",
"40　　蛇之果实-蟒蛇型——Boa·Sandersonia。可变成蟒蛇，头发可变成八岐大蛇。\n     眼镜蛇型——Boa.Marigod。可变成眼镜蛇，头发可变成沙罗曼蛇。",
--[[自然系]]
"41　　地震果实一一白胡子。可在任何地方施加地震。543话",
"42　　岩浆果实一一大将赤犬。可喷发岩浆。544话",
"43　　烟雾果实——Smoker。身体可变成烟雾，威力较弱。",
"44　　火焰果实——Portgas·D·Ace。身体可变成火焰，可制造、控制火焰，遇水会熄灭。",
"45　　沙之果实——Sir·Crocodie。身体可变成沙，可吸干接触物体的水分，可造成沙暴，接触液体的地方不可变成沙。",
"46　　黑暗果实——Marshall·D·Teach。可将与黑暗接触的物体吸入、压缩、粉碎，可吸引能力者，与之接触的能力者会暂时失去能力。",
"47　　轰雷果实——Enel。身体可变成电，可制造、释放雷电，绝缘体无效。",
"48　　冰冻果实——Kohza。可将与其接触的物体冰冻。",
"49　　闪光果实——Kprusoian。身体可变成光，可光速移动，手指可发出光线。",
"50 悄悄话果实 阿碧斯 《千年龙传说》可以听到任何动物心声（人类除外），理解动物的语言并且可以和动物对话。 ",
"51 镰刀果实 艾力克 《千年龙传说》 能扬起锋利的风,可进行斩击",
"52 糨糊果实 unkown 《发条岛的冒险》 身体能变成浆糊,但衣服不能跟着移动,弱点是密封的瓶子.浆糊冲击——双手放出冲击力极大的浆糊",
"53 软糖果实 嘉斯帕帝 剧场版《死亡尽头的冒险》身体可以象软糖一样自由变化的能力",
"54 轰隆隆果实(口中发出的音波可变成一束很像加农炮光束的攻击波) 黄金龙船长(只出现在剧场版第一部--《黄金大海贼》) ",
"55 水涛果实 红心皇后 (剧场版) 发条岛大冒险 可以让身体变成液态，能钻入任何细缝，产生大津波。",
"56 热热果实 阿齐诺（TV原创） 动画（326） 可以任意改变体温，范围从一度到一万度皆可 跌进熔岩里也丝毫无损",
"57 煤铁果实 熊国王 电影原创 能使之加热要象铁一样的状态的身体的一部分硬 ",
"58 瓦斯果实 スカンクワン 电影原创 身体能喷射煤气 遇火会爆炸",
"59 干纸果实 サイモン 电影原创 身体能变成纸张回避攻击 颜色的话能力变得不发动",
"60 音眠果实 ノコ 电影原创 听的话变得发困的声音使之发困的 可使睡着的人被显示自己想像的梦",
"61 缩小果实 ブリュー 电影原创 可自动缩小自己身体",
"62 磁力果实 由塔斯基·“船长”基德 （504） 能够自由的控制金属物体，刀枪炮之类的武器对其无效",
"63 斩空果实 “死亡外科医生”多拉法尔加·罗 （504） 可以创造一个半球体的空间，在空间内可以随意切割人和物体，但被切割者并没有死亡，因此他的能力是切割空间，此外他还可以自由组合被切割的部分，让对手失去战斗力",
"64 稻草果实 “魔术师”巴基尔·霍金斯 （508） 可以创造稻草替身来转移自身所受的伤害，自身也可以变成巨大的稻草人“降魔之相”进行攻击，但不属于自然系",
"65 龙龙果实 暴龙形态 “赤旗”X·德雷克 （498） 变成暴龙，是极为罕见的“古代种”动物系果实"
}

table.insert(main_help_table,".fruit 查看属于自己的果实")
function fruit(msg,msg_time,buddy_name,buddy_num,qun_name,qun_num)
	if string.match(msg,"^%.fruit")==nil then return end
	math.randomseed(os.time()+n)
	math.random()
	local a=math.random(1,65)
	say_qun(buddy_name.."在"..msg_time.."测试了自己的果实:\n"..T[a],qun_num)
end
