local T={
"第一卦 乾　乾為天　乾上乾下\n　　乾：元，亨，利，貞。\n    彖曰：大哉乾元，萬物資始，乃統天。雲行雨施，品物流形。大明始終，六位時成，時乘六龍以御天。乾道變化，各正性命，保合大和，乃利貞。首出庶物，萬國咸寧。\n　　象曰：天行健，君子以自強不息。潛龍勿用，陽在下也。見龍再田，德施普也。終日乾乾，反復道也。或躍在淵，進無咎也。飛龍在天，大人造也。亢龍有悔，盈不可久也。用九，天德不可為首也。",
"第二卦 坤　坤為地　坤上坤下\n　　坤：元，亨，利牝馬之貞。君子有攸往，先迷后得主，利西南得朋，東北喪朋。安貞，吉。\n　　彖曰：至哉坤元，萬物資生，乃順承天。坤厚載物，德合無疆。含弘光大，品物咸亨。牝馬地類，行地無疆，柔順利貞。君子攸行，先迷失道，后順得常。西南得朋，乃與類行﹔東北喪朋，乃終有慶。安貞之吉，應地無疆。\n　　象曰：地勢坤，君子以厚德載物。",
"第三卦 屯　水雷屯　坎上震下\n　　屯：元，亨，利，貞，勿用，有攸往，利建侯。\n　　彖曰：屯，剛柔始交而難生，動乎險中，大亨貞。雷雨之動滿盈，天造草昧，宜建侯而不寧。\n　　象曰：云，雷，屯﹔君子以經綸。",
"第四卦 蒙　山水蒙　艮上坎下\n　　蒙：亨。匪我求童蒙，童蒙求我。初噬告，再三瀆，瀆則不告。利貞。\n　　彖曰：蒙，山下有險，險而止，蒙。蒙亨，以亨行時中也。匪我求童蒙，童蒙求我，志應也。初噬告，以剛中也。再三瀆，瀆則不告，瀆蒙也。蒙以養正，聖功也。\n    象曰：山下出泉，蒙﹔君子以果行育德。",
"第五卦 需　水天需　坎上乾下\n　　需：有孚，光亨，貞吉。利涉大川。\n　　彖曰：需，須也﹔險在前也。剛健而不陷，其義不困窮矣。需有孚，光亨，貞吉。位乎天位，以正中也。利涉大川，往有功也。\n　　象曰：云上於天，需﹔君子以飲食宴樂。",
"第六卦 訟　天水訟　乾上坎下\n　　訟：有孚，窒。惕中吉。終凶。利見大人，不利涉大川。\n　　彖曰：訟，上剛下險，險而健訟。訟有孚窒，惕中吉，剛來而得中也。終凶﹔訟不可成也。利見大人﹔尚中正也。不利涉大川﹔入于淵也。\n　　象曰：天與水違行，訟﹔君子以作事谋始。",
"第七卦 師　地水師　坤上坎下\n　　師：貞，丈人，吉無咎。\n　　彖曰：師，眾也，貞正也，能以眾正，可以王矣。剛中而應，行險而順，以此毒天下，而民從之，吉又何咎矣。\n　　象曰：地中有水，師﹔君子以容民畜眾。",
"第九卦 小畜　風天小畜　巽上乾下\n　　小畜：亨。密云不雨，自我西郊。\n　　彖曰：小畜﹔柔得位，而上下應之，曰小畜。健而巽，剛中而志行，乃亨。密云不雨，尚往也。自我西郊，施未行也。\n　　象曰：風行天上，小畜﹔君子以懿文德。",
"第十卦 履　天澤履　乾上兌下\n　　履：履虎尾，不咥人，亨。\n　　彖曰：履，柔履剛也。說而應乎乾，是以履虎尾，不咥人，亨。剛中正，履帝位而不疚，光明也。\n　　象曰：上天下澤，履﹔君子以辨上下，安民志。",
"第十一卦 泰　地天泰　坤上乾下\n　　泰：小往大來，吉亨。\n　　彖曰：泰，小往大來，吉亨。則是天地交，而萬物通也﹔上下交，而其志同也。內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。\n　　象曰：天地交泰，后以財（裁）成天地之道，輔相天地之宜，以左右民。",
"第十二卦 否　天地否　乾上坤下\n　　否：否之匪人，不利君子貞，大往小來。\n　　彖曰：否之匪人，不利君子貞。大往小來，則是天地不交，而萬物不通也﹔上下不交，而天下無邦也。內陰而外陽，內柔而外剛，內小人而外君子。小人道長，君子道消也。\n　　象曰：天地不交，否﹔君子以儉德辟難，不可榮以祿。",
"第十三卦 同人　天火同人　乾上離下\n　　同人：同人于野，亨。利涉大川，利君子貞。\n　　彖曰：同人，柔得位得中，而應乎乾，曰同人。同人曰，同人于野，亨。利涉大川，乾行也。文明以健，中正而應，君子正也。唯君子為能通天下之志。\n　　象曰：天與火，同人﹔君子以類族辨物。",
"第十四卦 大有　火天大有　離上乾下\n　　大有：元亨。\n　　彖曰：大有，柔得尊位，大中而上下應之，曰大有。其德剛健而文明，應乎天而時行，是以元亨。\n　　象曰：火在天上，大有﹔君子以竭惡揚善，順天休命。",
"第十五卦 謙　地山謙　坤上艮下\n　　謙：亨，君子有終。\n　　彖曰：謙，亨，天道下濟而光明，地道卑而上行。天道虧盈而益謙，地道變盈而流謙，鬼神害盈而福謙，人道惡盈而好謙。謙尊而光，卑而不可踰，君子之終也。\n　　象曰：地中有山，謙﹔君子以裒多益寡，稱物平施。",
"第十六卦 豫　雷地豫　震上坤下\n　　豫：利建侯行師。\n　　彖曰：豫，剛應而志行，順以動，豫。豫，順以動，故天地如之，而況建侯行師乎？天地以順動，故日月不過，而四時不忒﹔聖人以順動，則刑罰清而民服。豫之時義大矣哉！\n　　象曰：雷出地奮，豫。先王以作樂崇德，殷荐之上帝，以配祖考。",
"第十七卦 隨　澤雷隨　兌上震下\n　　隨：元亨利貞，無咎。\n　　彖曰：隨，剛來而下柔，動而說，隨。大亨貞，無咎，而天下隨時，隨之時義大矣哉！\n　　象曰：澤中有雷，隨﹔君子以□晦入宴息。",
"第十八卦 蠱　山風蠱　艮上巽下\n　　蠱：元亨，利涉大川。先甲三日，后甲三日。\n　　彖曰：蠱，剛上而柔下，巽而止，蠱。蠱，元亨，而天下治也。利涉大川，往有事也。先甲三日，后甲三日，終則有始，天行也。\n　　象曰：山下有風，蠱﹔君子以振民育德。",
"第十九卦 臨　地澤臨　坤上兌下\n　　臨：元，亨，利，貞。至于八月有凶。\n　　彖曰：臨，剛浸而長。說而順，剛中而應，大亨以正，天之道也。至于八月有凶，消不久也。\n　　象曰：澤上有地，臨﹔君子以教思無窮，容保民無疆。",
"第二十卦 觀　風地觀　巽上坤下\n　　觀：盥而不荐，有孚顒若。\n　　彖曰：大觀在上，順而巽，中正以觀天下。觀，盥而不荐，有孚□若，下觀而化也。觀天之神道，而四時不忒，聖人以神道設教，而天下服矣。\n　　象曰：風行地上，觀﹔先王以省方，觀民設教。",
"第二十一卦 噬嗑　火雷噬嗑　離上震下\n　　噬嗑：亨。利用獄。\n　　彖曰：頤中有物，曰噬嗑，噬嗑而亨。剛柔分，動而明，雷電合而章。柔得中而上行，雖不當位，利用獄也。\n　　象曰：雷電噬嗑﹔先王以明罰敕法。",
"第二十二卦 賁　山火賁　艮上離下\n　　賁：亨。小利有所往。\n　　彖曰：賁，亨﹔柔來而文剛，故亨。分剛上而文柔，故小利有攸往。天文也﹔文明以止，人文也。觀乎天文，以察時變﹔觀乎人文，以化成天下。\n　　象曰：山下有火，賁﹔君子以明庶政，無敢折獄。",
"第二十三卦 剝　山地剝　艮上坤下\n　　剝：不利有攸往。\n　　彖曰：剝，剝也，柔變剛也。不利有攸往，小人長也。順而止之，觀象也。君子尚消息盈虛，天行也。\n　　象曰：山附地上，剝﹔上以厚下，安宅。",
"第二十四卦 復　地雷復　坤上震下\n　　復：亨。出入無疾，朋來無咎。反復其道，七日來復，利有攸往。\n　　彖曰：復亨﹔剛反，動而以順行，是以出入無疾，朋來無咎。反復其道，七日來復，天行也。利有攸往，剛長也。復其見天地之心乎？\n　　象曰：雷在地中，復﹔先王以至日閉關，商旅不行，后不省方。",
"第二十五卦 無妄　天雷無妄　乾上震下\n　　無妄：元，亨，利，貞。其匪正有眚，不利有攸往。\n　　彖曰：無妄，剛自外來，而為主於內。動而健，剛中而應，大亨以正，天之命也。其匪正有眚，不利有攸往。無妄之往，何之矣？天命不佑，行矣哉？\n　　象曰：天下雷行，物與無妄﹔先王以茂對時，育萬物。",
"第二十六卦 大畜　山天大畜　艮上乾下\n　　大畜：利貞，不家食吉，利涉大川。\n　　彖曰：大畜，剛健篤實輝光，日新其德，剛上而尚賢。能止健，大正也。不家食吉，養賢也。利涉大川，應乎天也。\n　　象曰：天在山中，大畜﹔君子以多識前言往行，以畜其德。",
"第二十七卦 頤　山雷頤　艮上震下\n　　頤：貞吉。觀頤，自求口實。\n　　彖曰：頤貞吉，養正則吉也。觀頤，觀其所養也﹔自求口實，觀其自養也。天地養萬物，聖人養賢，以及萬民﹔頤之時義大矣哉！\n　　象曰：山下有雷，頤﹔君子以慎言語，節飲食。",
"第二十八卦 大過　澤風大過　兌上巽下\n　　大過：棟橈，利有攸往，亨。\n　　彖曰：大過，大者過也。棟橈，本末弱也。剛過而中，巽而說行，利有攸往，乃亨。大過之時義大矣哉！\n　　象曰：澤滅木，大過﹔君子以獨立不懼，遯世無悶。",
"第二十九卦 坎　坎為水　坎上坎下\n　　坎：習坎，有孚，維心亨，行有尚。\n　　彖曰：習坎，重險也。水流而不盈，行險而不失其信。維心亨，乃以剛中也。行有尚，往有功也。天險不可升也，地險山川丘陵也，王公設險以守其國，坎之時用大矣哉！\n　　象曰：水洊至，習坎﹔君子以常德行，習教事。",
"第三十卦 離　離為火　離上離下\n　　離：利貞，亨。畜牝牛，吉。\n　　彖曰：離，麗也﹔日月麗乎天，百谷草木麗乎土，重明以麗乎正，乃化成天下。柔麗乎中正，故亨﹔是以畜牝牛吉也。\n　　象曰：明兩作離，大人以繼明照于四方。",
"第三十一卦 咸　澤山咸　兌上艮下\n　　咸：亨，利貞，取女吉。\n　　彖曰：咸，感也。柔上而剛下，二氣感應以相與，止而說，男下女，是以亨利貞，取女吉也。天地感而萬物化生，聖人感人心而天下和平﹔觀其所感，而天地萬物之情可見矣！\n　　象曰：山上有澤，咸﹔君子以虛受人。",
"第三十二卦 恆　雷風恆　震上巽下\n　　恆：亨，無咎，利貞，利有攸往。v　　彖曰：恆，久也。剛上而柔下，雷風相與，巽而動，剛柔皆應，恆。恆亨無咎，利貞﹔久於其道也，天地之道，恆久而不已也。利有攸往，終則有始也。日月得天，而能久照，四時變化，而能久成，聖人久於其道，而天下化成﹔觀其所恆，而天地萬物之情可見矣！\n　　象曰：雷風，恆﹔君子以立不易方。",
"第三十三卦 遯　天山遯　乾上艮下\n　　遯：亨，小利貞。\n　　彖曰：遯亨，遯而亨也。剛當位而應，與時行也。小利貞，浸而長也。遯之時義大矣哉！\n　　象曰：天下有山，遯﹔君子以遠小人，不惡而嚴。",
"第三十四大壯　雷天大壯　震上乾下\n　　大壯：利貞。\n　　彖曰：大壯，大者壯也。剛以動，故壯。大壯利貞﹔大者正也。正大而天地之情可見矣！\n　　象曰：雷在天上，大壯﹔君子以非禮勿履。",
"第三十五卦 晉　火地晉　離上坤下\n　　晉：康侯用錫馬蕃庶，晝日三接。\n　　彖曰：晉，進也。明出地上，順而麗乎大明，柔進而上行。是以康侯用錫馬蕃庶，晝日三接也。\n　　象曰：明出地上，晉﹔君子以自昭明德。",
"第三十六卦 明夷　地火明夷　坤上離下\n　　明夷：利艱貞。\n　　彖曰：明入地中，明夷。內文明而外柔順，以蒙大難，文王以之。利艱貞，晦其明也，內難而能正其志，箕子以之。\n　　象曰：明入地中，明夷﹔君子以蒞眾，用晦而明。",
"第三十七卦 家人　風火家人　巽上離下\n　　家人：利女貞。\n　　彖曰：家人，女正位乎內，男正位乎外，男女正，天地之大義也。家人有嚴君焉，父母之謂也。父父，子子，兄兄，弟弟，夫夫，婦婦，而家道正﹔正家而天下定矣。\n　　象曰：風自火出，家人﹔君子以言有物，而行有恆。",
"第三十八卦 睽　火澤睽　離上兌下\n　　睽：小事吉。\n　　彖曰：睽，火動而上，澤動而下﹔二女同居，其志不同行﹔說而麗乎明，柔進而上行，得中而應乎剛﹔是以小事吉。天地睽，而其事同也﹔男女睽，而其志通也﹔萬物睽，而其事類也﹔睽之時用大矣哉！\n　　象曰：上火下澤，睽﹔君子以同而異。",
"第三十九卦 蹇　水山蹇　坎上艮下\n　　蹇：利西南，不利東北﹔利見大人，貞吉。\n　　彖曰：蹇，難也，險在前也。見險而能止，知矣哉！蹇利西南，往得中也﹔不利東北，其道窮也。利見大人，往有功也。當位貞吉，以正邦也。蹇之時用大矣哉！\n　　象曰：山上有水，蹇﹔君子以反身修德。",
"第四十卦 解　雷水解　震上坎下 　　\n　　解：利西南，無所往，其來復吉。有攸往，夙吉。\n　　彖曰：解，險以動，動而免乎險，解。解利西南，往得眾也。其來復吉，乃得中也。有攸往夙吉，往有功也。天地解，而雷雨作，雷雨作，而百果草木皆甲坼，解之時義大矣哉！\n　　象曰：雷雨作，解﹔君子以赦過宥罪。",
"第四十一卦 損　山澤損　艮上兌下\n　　損：有孚，元吉，無咎，可貞，利有攸往？曷之用，二簋可用享。\n　　彖曰：損，損下益上，其道上行。損而有孚，元吉，無咎，可貞，利有攸 往。曷之用？二簋可用享﹔二簋應有時。損剛益柔有時，損益盈 虛，與時偕行。\n　　象曰：山下有澤，損﹔君子以懲忿窒欲。",
"第四十二卦 益　風雷益　巽上震下\n　　益：利有攸往，利涉大川。\n　　彖曰：益，損上益下，民說無疆，自上下下，其道大光。利有攸往，中正 有慶。利涉大川，木道乃行。益動而巽，日進無疆。天施地生， 其益無方。凡益之道，與時偕行。\n　　象曰：風雷，益﹔君子以見善則遷，有過則改。",
"第四十三卦 夬　澤天夬　兌上乾下\n　　夬：揚于王庭，孚號，有厲，告自邑，不利即戎，利有攸往。\n　　彖曰：夬，決也，剛決柔也。健而說，決而和，揚于王庭，柔乘五剛也。 孚號有厲，其危乃光也。告自邑，不利即戎，所尚乃窮也。利有 攸往，剛長乃終也。\n　　象曰：澤上于天，夬﹔君子以施祿及下，居德則忌。",
"第四十四卦 姤　天風姤　乾上巽下\n　　姤：女壯，勿用取女。\n　　彖曰：姤，遇也，柔遇剛也。勿用取女，不可與長也。天地相遇，品物 咸章也。剛遇中正，天下大行也。姤之時義大矣哉！\n　　象曰：天下有風，姤﹔后以施命誥四方。",
"第四十五卦 萃　澤地萃　兌上坤下\n　　萃：亨。王假有廟，利見大人，亨，利貞。用大牲吉，利有攸往。\n　　彖曰：萃，聚也﹔順以說，剛中而應，故聚也。王假有廟，致孝享也。利 見大人亨，聚以正也。用大牲吉，利有攸往，順天命也。觀其所 聚，而天地萬物之情可見矣。\n　　象曰：澤上於地，萃﹔君子以除戎器，戒不虞。",
"第四十六卦 升　地風升　坤上巽下\n　　升：元亨，用見大人，勿恤，南征吉。\n　　彖曰：柔以時升，巽而順，剛中而應，是以大亨。用見大人，勿恤﹔有慶 也。南征吉，志行也。\n　　象曰：地中生木，升﹔君子以順德，積小以高大。",
"第四十七卦 困　澤水困　兌上坎下\n　　困：亨，貞，大人吉，無咎，有言不信。\n　　彖曰：困，剛掩也。險以說，困而不失其所，亨﹔其唯君子乎？貞大人 吉，以剛中也。有言不信，尚口乃窮也。\n　　象曰：澤無水，困﹔君子以致命遂志。",
"第四十八卦 井　水風井　坎上巽下\n　　井：改邑不改井，無喪無得，往來井井。汔至，亦未繘井，羸其瓶， 凶。\n　　彖曰：巽乎水而上水，井﹔井養而不窮也。改邑不改井，乃以剛中也。汔 至亦未繘井，未有功也。羸其瓶，是以凶也。\n　　象曰：木上有水，井﹔君子以勞民勸相。",
"第四十九卦 革　澤火革　兌上離下\n　　革：己日乃孚，元亨利貞，悔亡。\n　　彖曰：革，水火相息，二女同居，其志不相得，曰革。己日乃孚﹔革而信 也。文明以說，大亨以正，革而當，其悔乃亡。天地革而四時成，湯武革命，順乎天而應乎人，革之時義大矣哉！\n　　象曰：澤中有火，革﹔君子以治歷明時。",
"第五十卦 鼎　火風鼎　離上巽下\n　　鼎：元吉，亨。\n　　彖曰：鼎，象也。以木巽火，亨飪也。聖人亨以享上帝，而大亨以養聖 賢。巽而耳目聰明，柔進而上行，得中而應乎剛，是以元亨。\n　　象曰：木上有火，鼎﹔君子以正位凝命。",
"第五十一卦 震　震為雷　震上震下\n　　震：亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。\n　　彖曰：震，亨。震來虩虩，恐致福也。笑言啞啞，后有則也。震驚百 里，驚遠而懼邇也。出可以守宗廟社稷，以為祭主也。\n　　象曰：洊雷，震﹔君子以恐懼修身。",
"第五十二卦 艮　艮為山　艮上艮下\n 　　艮：艮其背，不獲其身，行其庭，不見其人，無咎。\n　　彖曰：艮，止也。時止則止，時行則行，動靜不失其時，其道光明。艮 其止，止其所也。上下敵應，不相與也。是以不獲其身，行其庭不見其人，無咎也。\n　　象曰：兼山，艮﹔君子以思不出其位。",
"第五十三卦 漸　風山漸　巽上艮下\n　　漸：女歸吉，利貞。\n　　彖曰：漸之進也，女歸吉也。進得位，往有功也。進以正，可以正邦也。 其位剛，得中也。止而巽，動不窮也。\n　　象曰：山上有木，漸﹔君子以居賢德，善俗。",
"第五十四卦 歸妹　雷澤歸妹　震上兌下\n　　歸妹：征凶，無攸利。\n　　彖曰：歸妹，天地之大義也。天地不交，而萬物不興，歸妹人之終始也。 說以動，所歸妹也。征凶，位不當也。無攸利，柔乘剛也。\n　　象曰：澤上有雷，歸妹﹔君子以永終知敝。",
"第五十五卦 豐　雷火豐　震上離下\n　　豐：亨，王假之，勿憂，宜日中。\n　　彖曰：豐，大也。明以動，故豐。王假之，尚大也。勿憂宜日中，宜照 天下也。日中則昃，月盈則食，天地盈虛，與時消息，而況人於人乎？況於鬼神乎？\n　　象曰：雷電皆至，豐﹔君子以折獄致刑。",
"第五十六卦 旅　火山旅　離上艮下\n　　旅：小亨，旅貞吉。\n　　彖曰：旅，小亨，柔得中乎外，而順乎剛，止而麗乎明，是以小亨，旅貞 吉也。旅之時義大矣哉！\n　　象曰：山上有火，旅﹔君子以明慎用刑，而不留獄。",
"第五十七卦 巽　巽為風　巽上巽下\n　　巽：小亨，利攸往，利見大人。\n　　彖曰：重巽以申命，剛巽乎中正而志行。柔皆順乎剛，是以小亨，利有攸 往，利見大人。\n　　象曰：隨風，巽﹔君子以申命行事。",
"第五十八卦 兌　兌為澤　兌上兌下\n　　兌：亨，利貞。\n　　彖曰：兌，說也。剛中而柔外，說以利貞，是以順乎天，而應乎人。說 以先民，民忘其勞﹔說以犯難，民忘其死﹔說之大，民勸矣哉！\n　　象曰：麗澤，兌﹔君子以朋友講習。",
"第五十九卦 渙　風水渙　巽上坎下\n　　渙：亨。王假有廟，利涉大川，利貞。\n　　彖曰：渙，亨。剛來而不窮，柔得位乎外而上同。王假有廟，王乃在中 也。利涉大川，乘木有功也。\n　　象曰：風行水上，渙﹔先王以享于帝立廟。",
"第六十卦 節　水澤節　坎上兌下\n　　節：亨。苦節不可貞。\n　　彖曰：節，亨，剛柔分，而剛得中。苦節不可貞，其道窮也。說以行險， 當位以節，中正以通。天地節而四時成，節以制度，不傷財，不害民。\n　　象曰：澤上有水，節﹔君子以制數度，議德行。",
"第六十一卦 中孚　風澤中孚　巽上兌下\n　　中孚：豚魚吉，利涉大川，利貞。\n　　彖曰：中孚，柔在內而剛得中。說而巽，孚，乃化邦也。豚魚吉，信及 豚魚也。利涉大川，乘木舟虛也。中孚以利貞，乃應乎天也。\n　　象曰：澤上有風，中孚﹔君子以議獄緩死。",
"第六十二卦 小過　雷山小過　震上艮下\n　　小過：亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上宜下，大吉。\n　　彖曰：小過，小者過而亨也。過以利貞，與時行也。柔得中，是以小事 吉也。剛失位而不中，是以不可大事也。有飛鳥之象焉，有飛鳥遺之音，不宜上宜下，大吉﹔上逆而下順也。\n　　象曰：山上有雷，小過﹔君子以行過乎恭，喪過乎哀，用過乎儉。",
"第六十三卦 既濟　水火既濟　坎上離下\n　　既濟：亨，小利貞，初吉終亂。\n　　彖曰：既濟，亨，小者亨也。利貞，剛柔正而位當也。初吉，柔得中也。 終止則亂，其道窮也。\n　　象曰：水在火上，既濟﹔君子以思患而預防之。",
"第六十四卦 未濟　火水未濟　離上坎下\n　　未濟：亨，小狐汔濟，濡其尾，無攸利。\n　　彖曰：未濟，亨﹔柔得中也。小狐汔濟，未出中也。濡其尾，無攸利﹔ 不續終也。雖不當位，剛柔應也。\n　　象曰：火在水上，未濟﹔君子以慎辨物居方。"
}

table.insert(main_help_table,".zhan 占卜命运的经典版本")
function zhan(msg,msg_time,buddy_name,buddy_num,qun_name,qun_num)
	if string.match(msg,"^%.zhan")==nil then return end
	math.randomseed(os.time()+n)
	math.random()
	local a=math.random(1,64)
	local reason=string.match(msg,"^%.zhan (.*)")
	if reason~=nil then
		say_qun(buddy_name.."在"..msg_time.."对"..reason.."进行了一次占卜:\n"..T[a],qun_num)
	else
		say_qun(buddy_name.."在"..msg_time.."进行了一次占卜:\n"..T[a],qun_num)
	end
end
